{
  "categorias": [
    {
      "name": "Eletrônicos",
      "thumbnail": "/assets/categories/thumbnail/eletronicos.png",
      "header": "/assets/categories/header/eletronicos.png",
      "id": "eletronicos",
      "description": "Os melhores e mais atuais dispositivos eletrônicos estão aqui!"
    }, {
      "name": "Automotivo",
      "thumbnail": "/assets/categories/thumbnail/automotivo.png",
      "header": "/assets/categories/header/automotivo.png",
      "id": "automotivos",
      "description": "Encontre aqui equipamentos para deixar seu carro com a sua cara!"
    }, {
      "name": "Jogos",
      "thumbnail": "/assets/categories/thumbnail/jogos.png",
      "header": "/assets/categories/header/jogos.png",
      "id": "jogos",
      "description": "Adquira os consoles e jogos mais atuais do mercado !"
    }, {
      "name": "Escritório",
      "thumbnail": "/assets/categories/thumbnail/escritorio.png",
      "header": "/assets/categories/header/escritorio.png",
      "id": "escritorio",
      "description": "Tudo para o que escritório ficar incrível!"
    }, {
      "name": "Som e imagem",
      "thumbnail": "/assets/categories/thumbnail/som.png",
      "header": "/assets/categories/header/som.png",
      "id": "som",
      "description": "Curta suas músicas e seus filmes com a melhor qualidade!"
    }
  ],
  "items": [
    {
      "id": 1,
      "title": "Assistente virtual",
      "description": "Conheça nosso smart speaker de maior sucesso ainda melhor. O novo design de áudio com direcionamento frontal (1 speaker de 1,6\") garante mais graves e um som completo.",
      "photo": "/assets/items/assistente-virtual-tela.png",
      "favorite": false,
      "price": 285,
      "categorie": "eletronicos"
    }, {
      "id": 2,
      "title": "AirPods com Estojo de Recarga",
      "description": "Os AirPods ligam automaticamente e estão sempre conectados e sabem quando estão nos seus ouvidos e pausam quando são tirados. Para ajustar o volume, trocar de música, fazer uma ligação.",
      "photo": "/assets/items/airpod.png",
      "favorite": false,
      "price": 900,
      "categorie": "eletronicos"
    }, {
      "id": 3,
      "title": "Tablet Wi-Fi",
      "description": "Com o chip A12Z Bionic, o novo Tablet Pro garante maior fluidez em tarefas diárias, trabalhos e muito mais edite vídeos em 4K, crie objetos 3D e utilize realidade aumentada de forma natural e instantânea.",
      "photo": "/assets/items/tablet.png",
      "favorite": false,
      "price": 637,
      "categorie": "eletronicos"
    }, {
      "id": 4,
      "title": "Assistente virtual com tela",
      "description": "Desenvolvido para se mover com você: com um display HD de 10,1\" que se move automaticamente, as chamadas de vídeo, as receitas e os filmes e séries estarão sempre à vista. Os alto-falantes oferecem som direcional premium e de alta qualidade.",
      "photo": "/assets/items/assistente-virtual-tela.png",
      "favorite": false,
      "price": 1600,
      "categorie": "eletronicos"
    }, {
      "id": 5,
      "title": "Leitor de livros digitais",
      "description": "O Leitor de livros digitais com a maior e melhor resolução - tela Paperwhite de 7\" e 300 ppi. Leia como se fosse em papel, sem reflexo, mesmo sob a luz do sol.",
      "photo": "/assets/items/leitor-livros.png",
      "favorite": false,
      "price": 447,
      "categorie": "eletronicos"
    }, {
      "id": 6,
      "title": "Almofada de assento",
      "description": "Feito de material de couro, confortável e suave. Couro ambiental natural dá uma sensação delicada. Adequado para uso durante todo o ano. Com as funções de aquecimento e ventilação do assento de carro podem ser usadas normalmente.",
      "photo": "/assets/items/assento.png",
      "favorite": false,
      "price": 45.90,
      "categorie": "automotivos"
    }, {
      "id": 7,
      "title": "Capa de volante de couro",
      "description": "Esta capa de volante feita de couro sintético, antiderrapante, respirável. 100% SEM ODOR: elástico saudável e ecológico, não tóxico, durável. Melhor aderência no volante proporciona uma ótima e confortável experiência de direção.",
      "photo": "/assets/items/capa-volante-couro.png",
      "favorite": false,
      "price": 150,
      "categorie": "automotivos"
    }, {
      "id": 8,
      "title": "Organizador lateral",
      "description": "Aumente mais espaço e garanta a segurança – todos os motoristas sabem que é muito perigoso que nosso telefone caia na lacuna entre o assento frontal e o lado do console durante a condução, este enchimento de lacuna de assento de carro cria armazenamento extra para você para evitar que coisas perigosas aconteçam, pode armazenar coisas como smartphone, carteira,que garante a condução segura.",
      "photo": "/assets/items/organizador-lateral.png",
      "favorite": false,
      "price": 149.90,
      "categorie": "automotivos"
    }, {
      "id": 9,
      "title": "Capa de volante de cristais",
      "description": "Material da capa do volante de cristal: Couro de alta qualidade e artesanato em diamante: mais estável em comparação com outros mesmos produtos, e não machuca suas mãos. Esta capa de volante brilhante para mulheres meninas é universal para volante com diâmetro de 37-38 cm/14,5-15 pol. ",
      "photo": "/assets/items/capa-volante-cristais.png",
      "favorite": false,
      "price": 290,
      "categorie": "automotivos"
    }, {
      "id": 10,
      "title": "Suporte Veicular",
      "description": "Com o Suporte Veicular Magnetico 3 em 1 i2GO PRO você posiciona seu Smartphone de qualquer tamanho e outros dispositivos onde quiser de maneira fácil e segura. Ideal para o utilização de aplicativos de GPS e controlar músicas no carro, assistir a filmes e séries em casa, além de atender chamadas de vídeo e conferir documentos e mensagens no escritório.",
      "photo": "/assets/items/suporte-veicular.png",
      "favorite": false,
      "price": 59.90,
      "categorie": "automotivos"
    }, {
      "id": 11,
      "title": "Console",
      "description": "O console que está em pré-venda oferece novas possibilidades de jogabilidade que você nunca imaginou. Além disso, você também pode baixar jogos digitais, Experimente o carregamento extremamente rápido do SSD de 825GB com ultra-velocidade, uma imersão mais profunda com suporte à resposta tátil, gatilhos adaptáveis e áudio 3D.",
      "photo": "/assets/items/console-1.png",
      "favorite": false,
      "price": 4300,
      "categorie": "jogos"
    }, {
      "id": 12,
      "title": "Jogo para console",
      "description": "Embarque em uma jornada épica e comovente e lute contra queles que desafiam o destino que anseia por conhecimento para ajudá-lo a entender a profecia e o papel que ele desempenhará. Você deve decidir se será acorrentado pelo medo de repetir seus erros ou se libertar de seu passado para ser o pai que precisa.",
      "photo": "/assets/items/jogo-1.png",
      "favorite": false,
      "price": 299.90,
      "categorie": "jogos"
    }, {
      "id": 13,
      "title": "Console",
      "description": "Menor e mais elegante de todos os tempos. Com taxas de quadros mais altas, tempos de carregamento mais rápidos e mundos mais ricos e dinâmicos, oferece desempenho e velocidade de última geração em um formato compacto e totalmente digital e também possui os melhores serviços para jogadores de todos os tipos.",
      "photo": "/assets/items/console-2.png",
      "favorite": false,
      "price": 4349,
      "categorie": "jogos"
    }, {
      "id": 14,
      "title": "Controle joystick sem fio",
      "description": "Este controle combina funções revolucionárias, preservando precisão, conforto e exatidão em cada movimento. Graças à sua ergonomia especialmente projetada para a posição da sua mão, você pode passar horas jogando com total conforto.",
      "photo": "/assets/items/manete.png",
      "favorite": false,
      "price": 279,
      "categorie": "jogos"
    }, {
      "id": 15,
      "title": "Jogo para console",
      "description": "Em sua mais nova aventura um adolescente está se ajustando a sua nova casa mas quando uma luta feroz pelo poder ameaça destruir sua nova casa, o aspirante a herói percebe que com grandes poderes, também deve vir uma grande responsabilidade para salvar toda a Nova Iorque deve assumir o manto de herói.",
      "photo": "/assets/items/jogo-2.png",
      "favorite": false,
      "price": 349.90,
      "categorie": "jogos"
    }, {
      "id": 16,
      "title": "Organizador de Mesa",
      "description": "Moderno, funcional e versátil com acabamento em plástico de alta qualidade e construção robusta que se adapta a qualquer ambiente. (5 compartimentos e 1 divisão na parte traseira). Em sua área de trabalho, mantenha tudo limpo e organizado, como caneta, lápis, tesoura, clipes, notas adesivas, acessórios e muito mais para economizar espaço com estilo.",
      "photo": "/assets/items/guarda-treco.png",
      "favorite": false,
      "price": 19.90,
      "categorie": "escritorio"
    }, {
      "id": 17,
      "title": "Caderno Inteligente",
      "description": "Caderno inteligente com calendário, elástico para caneta e divisórias Formato: 215 x 280 mm (lxa) Com 60 folhas pautadas e 20 folhas lisas brancas de 90 gramas que você tira e coloca quando quiser Fabricado com muito cuidado e atenção aos detalhes",
      "photo": "/assets/items/caderno.png",
      "favorite": false,
      "price": 285,
      "categorie": "escritorio"
    }, {
      "id": 18,
      "title": "Cadeira de Escritório",
      "description": "Base giratória em 360º de polipropileno com 5 rodízios;Ajuste de altura a gás;Encosto com estrutura de madeira com estofamento revestido em couro PU;Assento com madeira multi laminada com estofamento revestido em couro PU;Braços em polipropileno com estofamento revestido em couro PU; Espuma com densidade controlada.",
      "photo": "/assets/items/cadeira.png",
      "favorite": false,
      "price": 629,
      "categorie": "escritorio"
    }, {
      "id": 19,
      "title": "Papel Sulfite A4 75g 500 folhas",
      "description": "Desenvolvido para ser utilizado em atividades escolares e profissionais corte perfeito e equilibrada absorção, permite melhor deslizamento do papel na impressora. Produzido com eucalipto 100% renovável e as fibras são tratadas para obter o mais elevado grau de brancura. Chamex garante excelente performance em equipamentos e impressoras de alta velocidade, com 99% de não atolamento das folhas em sua impressora.",
      "photo": "/assets/items/papel.png",
      "favorite": false,
      "price": 27.60,
      "categorie": "escritorio"
    }, {
      "id": 20,
      "title": "Arquivo Estreito com Furação",
      "description": "Ideal para a organização de pastas e papéis. Organize seus documentos e pastas suspensas em um só lugar, poupando espaço em gavetas. Possui encaixe para acomodas as pastas sem amassar. Contém furos para ventilação do organizador e design diferenciado. Organiza e deixa seu ambiente mais bonito.",
      "photo": "/assets/items/organizador-pastas.png",
      "favorite": false,
      "price": 44.90,
      "categorie": "escritorio"
    }, {
      "id": 21,
      "title": "TV Smart 50",
      "description": "A Smart TV LED 50\" equipada com a tecnologia de Business TV que permite configurar a TV tanto para o modo residencial quanto para o modo hotel, trazendo uma maior variedade de configurações e personalizações para sua TV. Além de possui uma ótima qualidade de imagem 4K.",
      "photo": "/assets/items/tv-50.png",
      "favorite": false,
      "price": 2600,
      "categorie": "som"
    }, {
      "id": 22,
      "title": "Smart TV 60\" 4K UHD",
      "description": "Smart TV LG 60\" 4K UHD WiFi Bluetooth Inteligência Artificial, Painel de Controle, Processamento Natural de Linguagem, AI Recommendation, Otimizador de Games, Channels, Edição Inteligente de Apps e Media Player.",
      "photo": "/assets/items/tv-60.png",
      "favorite": false,
      "price": 3359,
      "categorie": "som"
    }, {
      "id": 23,
      "title": "Caixa de Som",
      "description": "A caixa de som 710 à prova de respingos transforma seu próximo evento em uma verdadeira festa, show ou balada. Show de luzes único e colorido sincronizado com seu aparelho de celular. Botões minimalistas e intuitivos no painel superior e o aplicativo permitem criar experiências musicais e visuais de alto nível. Com luzes estroboscópicas piscantes personalizáveis e o som incrível do conjunto duplo de tweeters e woofers ricos em graves.",
      "photo": "/assets/items/caixa-som.png",
      "favorite": false,
      "price": 5817.33,
      "categorie": "som"
    }, {
      "id": 24,
      "title": "Caixa de Som Bluetooth",
      "description": "Caixa de som oferece o ousado som com driver de longa excursão otimizado, tweeter separado e dois radiadores de graves. Até 20 horas de reprodução e um prático powerbank para manter carregados os dispositivos que fazem a festa a noite toda.",
      "photo": "/assets/items/caixa-som-bluetooth.png",
      "favorite": false,
      "price": 1199,
      "categorie": "som"
    }, {
      "id": 25,
      "title": "Mini System com Função karaokê",
      "description": "Moderno e superpotente, o Mini System vai reproduzir suas músicas com qualidade máxima nos mais diversos formatos, como MP3, WMA CD, CD-R e CD-RW. E, se a ideia for promover festas e encontros animados, a função karaokê, a conexão Bluetooth e as duas portas USB serão bastante úteis.",
      "photo": "/assets/items/mini-system.png",
      "favorite": false,
      "price": 782.91,
      "categorie": "som"
    }
  ],
  "users": [{
    "id": 1,
    "name": "João"
  }, {
    "id": 2,
    "name": "Maria"
  }],
  "cards": [{
    "name": "Cartão da Maria 1",
    "flagId": 10,
    "balance": 300,
    "userId": 2,
    "id": "1"
  }, {
    "name": "Cartão da Maria 2",
    "flagId": 20,
    "balance": 500,
    "userId": 2,
    "id": "2"
  }, {
    "name": "Cartão da Maria 3",
    "flagId": 30,
    "balance": 1000,
    "userId": 2,
    "id": "3"
  }, {
    "name": "Cartão do João 1",
    "flagId": 10,
    "balance": 0,
    "userId": 1,
    "id": "4"
  }, {
    "name": "Cartão do João 2",
    "flagId": 20,
    "balance": 200,
    "userId": 1,
    "id": "5"
  }, {
    "name": "Cartão do João 3",
    "flagId": 30,
    "balance": 500,
    "userId": 1,
    "id": "6"
  }],
  "flags": [{
    "name": "Verde",
    "id": 10,
    "rate": 1.1
  }, {
    "name": "Vermelho",
    "id": 20,
    "rate": 1.3
  }, {
    "name": "Amarela",
    "id": 30,
    "rate": 1.5
  }]
}